module.exports = {
  config: {
    name: "murgi2",
    version: "1.0",
    author: "𝐌𝐑.𝐀𝐘𝐀𝐍",
    role: 2,
    category: "texts",
    guide: {
      vi: "Not Available",
      en: "cpx @(mention)"
    } 
  },

  onStart: async function ({ api, event, userData, args }) {
      var mention = Object.keys(event.mentions)[0];
    if(!mention) return api.sendMessage("- নবিন খানকির পোলা রে একটা ম্যাশন দেন-!!😗", event.threadID);
 let name =  event.mentions[mention];
    var arraytag = []; 
        arraytag.push({id: mention, tag: name});
    var a = function (a) { api.sendMessage(a, event.threadID); }
setTimeout(() => {a({body: "- ভারচুয়াল এর টপ-১ গালি খোর-!!🦍" + " " + name, mentions: arraytag})}, 3000);
setTimeout(() => {a({body: "- Eiii khankir pola tor ma ar kosom msg seen dibi and sob porby-!!🙄🙄🙄" + " " + name, mentions: arraytag})}, 5000);
setTimeout(() => {a({body: "- Kire tor ma ar buira vudai tas tas kore jutar bari dimu sala homundir put-!!👋🏻👋🏻🥵🥵" + " " + name, mentions: arraytag})}, 7000);
setTimeout(() => {a({body: "- Kire khanki magir pola tor bon re chudisi ami-!!🥵🥵🖕🏻🖕🏻" + " " + name, mentions: arraytag})}, 9000);
setTimeout(() => {a({body: "- Msg seen de naile tor mai re chudiii-!!🖕🏻🖕🏻🖕🏻🥵🥵🥵🥵🖕🏻🖕🏻" + " " + name, mentions: arraytag})}, 12000);
setTimeout(() => {a({body: "- Khanki magir pola tui amr jaroj sontan-!!😂😂😂🥵🖕🏻" + " " + name, mentions: arraytag})}, 14000);
setTimeout(() => {a({body: "- কিরে চুদানি খানকির পোলা-!!💋🥵🥵🖕🏻🖕🏻" + " " + name, mentions: arraytag})}, 16000);
setTimeout(() => {a({body: "- এই নবিন খানকির পোলা তোর মারে চুদে তোর বোন একটা জন্ম দিয়ে ওই তোর বোন রে চুদে মেরে ফেলছি আমি-!!🥵🥵🥵🖕🏻🖕🏻🖕🏻🖕🏻" + " " + name, mentions: arraytag})}, 18000);
setTimeout(() => {a({body: "- এই নোটিমাগির পোলা তোর খালা রে ভুদা ফাক করে চুদছিও আমি🥵🥵🥵🖕🏻🖕🏻🖕🏻" + " " + name, mentions: arraytag})}, 20000);
setTimeout(() => {a({body: "- কিরে নবিন খানকির পোলা তোর বাপ আমি আব্বা ডাক নাইলে তোর মা রে টাস টাস করে চুদে দিমু-!!🥵🥵🥵🖕🏻🖕🏻🖕🏻" + " " + name, mentions: arraytag})}, 22000);
setTimeout(() => {a({body: "- কিরে তোর বস্তি বস্তি মারে চুদি-!!😂😂😂😂😂" + " " + name, mentions: arraytag})}, 2400);
setTimeout(() => {a({body: "- মাগির পোলা চোর খানকির পোলার মাইরে আমি রাত দিন ভরে চুদি-!!😂😂😂🖕🏻🖕🏻🥵🥵🥵" + " " + name, mentions: arraytag})}, 26000);
setTimeout(() => {a({body: "- তোর ২ ইঞ্চি ধোন তোর মার ভুদার ভিতরে ডুকা-!!🥵🥵🥵🖕🏻🖕🏻🦍" + " " + name, mentions: arraytag})}, 28000);
setTimeout(() => {a({body: "- মাগির পোলা তোর মা এর ভুদায় ইঁদুর ছেড়ে দিমু-!!🦍🦍🦍" + " " + name, mentions: arraytag})}, 30000);
setTimeout(() => {a({body: "- কিরে নবিন খানকির পোলা মেসেজ দেখ নাইলে তোর মাইরে চুদি-!!🐒🐒🐒😂😂🙈🙈" + " " + name, mentions: arraytag})}, 32000);
setTimeout(() => {a({body: "- উম্মাহ তোর বিয়া করা বউ এর জুলা পম পম এ-!!🦍🦍🥵🥵🥵🖕🏻🖕🏻" + " " + name, mentions: arraytag})}, 65000);
setTimeout(() => {a({body: "- তোর বউরে বাসর রাতে চুদছি আমি তোর বউ এর পেটে বাচ্চা আমার-!!🥵🥵🥵🥵🦍🦍🖕🏻🖕🏻" + " " + name, mentions: arraytag})}, 34000);
setTimeout(() => {a({body: "- কিন্তু তোর বউটে চুদে সেই ফিলিংস পাইছি ইসস কি কচি ভুদা-!!🥵🥵🥵🥵🥵🥵🖕🏻🖕🏻🖕🏻" + " " + name, mentions: arraytag})}, 36000);
setTimeout(() => {a({body: "- কিরে তোর আব্বা আমি আব্বা ডাক নাইলে তোর বউরে টাস টাস করে চুদবো-!!🥵🥵🦍🦍🦍🦍🦍" + " " + name, mentions: arraytag})}, 38000);
setTimeout(() => {a({body: "- ওই মাগির পোলা শুরু করলাম তো বোন এর কচি পম পম নিয়ে-!!🤭🤭🤭🐒🐒" + " " + name, mentions: arraytag})}, 40000);
setTimeout(() => {a({body: "- তোর বোন এর কুচি পম পম সেই সাধ খাইতে তুইও খাইলে আয় 🥵🥵🥵🥵🥵🥵🫵🏻🫵🏻🫵🏻" + " " + name, mentions: arraytag})}, 44000);
setTimeout(() => {a({body: "- তোর বোন এর কচি পম পম চুসে দুদু খাচ্ছি আমি-!!🥵🥵🥵🐒🐒🤭🤭" + " " + name, mentions: arraytag})}, 460000);
setTimeout(() => {a({body: "- তোর বোন এর পম এ এয়াক থুুুু-!!🤮🤮🤮🤮😂" + " " + name, mentions: arraytag})}, 48000);
setTimeout(() => {a({body: "- কইতে হবে তোর বোন এর পম পম টিপে সেই মজা পাইছি-!!🥵🥵🥵🥵🥵🙈🙈" + " " + name, mentions: arraytag})} , 50000);
setTimeout(() => {a({body: "- তোর বোন এর পম পম এ দুদু শেষ-!!😒😒😒😒" + " " + name, mentions: arraytag})} , 52000);
setTimeout(() => {a({body: "- আচ্ছা আমি দুদু খাইছি এখন চুদতে হবে 🥵🥵🥵🥵-!!🖕🏻🖕🏻🖕🏻" + " " + name, mentions: arraytag})} , 56000);
setTimeout(() => {a({body: "- শুরু করলাম তো বোন এর কুচি ভুদা নিয়া-!!🐒🐒🐒🐒" + " " + name, mentions: arraytag})} , 58000);
setTimeout(() => {a({body: "- তের বোন এর কুচি ভুদায় আনাম তাল গাছ ঢুকাবো🥵🥵🥵🖕🏻🖕🏻🖕🏻🖕🏻" + " " + name, mentions: arraytag})} , 60000);
setTimeout(() => {a({body: "- তোর বোন এর ভুদায় নারিকেল তেল দিয়ে উগান্ডা এর মানুষ দিয়ে চুদাবো-!!🥵🖕🏻🖕🏻🖕🏻🖕🏻🖕🏻🖕🏻🥵🥵🥵🐒🐒" + " " + name, mentions: arraytag})} , 62000);
setTimeout(() => {a({body: "- কিরে মাদারচোদ তোর বোম এর ভুদা তো সেই নরম চুদতাছি আমি-!!🥵🥵🥵🖕🏻🖕🏻🥵🖕🏻🥵🖕🏻🥵"+ " " + name, mentions: arraytag})} , 64000);
setTimeout(() => {a({body: "- তোর বোনরে পদ্মা সেতুর ৭ নাম্বার পিলারের সাথে হাত পা বেদে কালা কুত্তা দিয়ে চুদামু-!!🥵🥵😂😂😂🦍🦍" + " " + name, mentions: arraytag})} , 66000);
setTimeout(() => {a({body: "- তোর বোন রে মাসিক আটকাইয়া মেরে ফেলবো-!!😈😈😈" + " " + name, mentions: arraytag})} , 68000);
setTimeout(() => {a({body: "- হোগার ভিতরে ভইড়া দিমু…ঠ্যাঁঙ কাইট্টা পুটকি দা ভইরা দুম! হালা ল্যাওড়া চোদা-!!🥵🥵🥵😂😂😈😈😈" + " " + name, mentions: arraytag})} , 70000);
setTimeout(() => {a({body: "- শুয়োরের বাচ্চা কুত্তার বাচ্ছা হারামির বাচ্চা হারামি হারামজাদা হারামখোর খান্কি মাগির পোলা-!!😈😈😈😈😈😈😈😈😈" + " " + name, mentions: arraytag})} , 72000);
setTimeout(() => {a({body: "- আবাল চোদা কান্দে ফালাইয়া তোর বোনরে চুদি🥵🥵" + " " + name, mentions: arraytag})} , 74000);
setTimeout(() => {a({body: "- তোর মার ভোদায় পাব্লিক টয়লেট 🥵তর মায়ের ভুদাতে পোকা 🥵তর বাপের ধোন তর বউয়ের ভোদাতেদিমু-!!🥵🥵🥵🖕🏻🖕🏻🖕🏻🖕🏻😂😂🥵🥵" + " " + name, mentions: arraytag})} , 76000);
setTimeout(() => {a({body: "- শুয়োরের বাচ্চা কুত্তার বাচ্ছা হারামির বাচ্চা হারামি হারামজাদা হারামখোর খান্কি মাগির পোলা-!!😂😂😂😂😈😈😈😈😈🖕🏻🖕🏻🖕🏻🖕🏻🖕🏻" + " " + name, mentions: arraytag})} , 78000);
setTimeout(() => {a({body: "- কিরে খানকির পোলার তোর মারে আমার পালা কুকুর টর ধোন দিয়া চুদামু-!!🥵🥵🥵😂😂😂🖕🏻🖕🏻😈😈😈" + " " + name, mentions: arraytag})} , 80000);
setTimeout(() => {a({body: "- তোর মায়ের ভোদা শিরিষ কাগজ দিয়া ঘইষা রক্ত বের করে আবার সেই রক্ত তোরে দিয়া চাটামু-!!🥵🥵🥵🖕🏻🖕🏻🖕🏻😂😈😈😈" + " " + name, mentions: arraytag})} , 82000);
setTimeout(() => {a({body: "- তোর মা বোন  দের চুদা শেষ এখন ওদের ভাইরাল ভিডিও গুগুলে ছেড়ে দিবো-!!😂😂😂🖕🏻🖕🏻🖕🏻😈😈😈😈😈" + " " + name, mentions: arraytag})} , 84000);
setTimeout(() => {a({body: "- Virtual king Ayan tor abbu akhon vagggg-!!😈😈😈😈😈😈😈" + " " + name, mentions: arraytag})} , 84000);
  }
};
